---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException
source: html/aef6d5f4-e7b4-9000-02f9-b04e8158b950.htm
---
# OutdatedDirectlyOpenedCentralException Methods

Retrieves data needed to serialize the target object.